[
    
    {
        "name": "Ariel",
        "category": "Princess",
        "story": "The Little Mermaid",
        "channel": "Disney",
        "id": 1001,
        "isFeatured": false,
        "isFavorite": true,
        "link": "https://princess.disney.com/ariel",
        "details": "https://disneyprincess.fandom.com/wiki/The_Little_Mermaid",
        "description": "Ariel is the protagonist of the films The Little Mermaid, The Little Mermaid II (although the title of the main female protagonist is shared with Melody) and The Little Mermaid III, as well as The Little Mermaid Television Series, based off of the Danish fairytale by Hans Christian Anderson. Jodi Benson provides both the speaking and singing voices of Ariel in all Disney animated appearances. Ariel is the first Disney Princess to have not been born human and is also the first Disney Princess confirmed to have children as she and Eric have a daughter, Melody, in the sequel. She is sixteen years old in the first film and is presumably in her late twenties in the sequel. Ariel's title of Princess comes from her father, King Triton, a title she shares with her six older sisters. She acquires the title of Princess Consort through her marriage to Prince Eric, though it is unclear whether he is a Prince Regnant (most likely), the son of a King, or both.",
        "imageName": "Ariel"
    },
    
    {
        "name": "Aurora",
        "category": "Princess",
        "story": "Sleeping Beauty",
        "channel": "Disney",
        "id": 1002,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/aurora",
        "details": "https://disneyprincess.fandom.com/wiki/Sleeping_Beauty",
        "description": "Aurora is the titular protagonist of the film Sleeping Beauty, based on the classic fairy tale involving a beautiful princess, a sleeping enchantment, and a handsome prince. Aurora is sixteen years old. Mary Costa provides the voice/singing voice for Aurora, giving her a British accent. The original story is much darker than the Disney version. It is Italian and involves her falling under a spell after getting a splinter, and the rest is too grim to put on here. Disney based theirs off the French version, which was based on the Italian version. Aurora has the distinction of being both the Princess with the least amount of screen time and singing more of her lines than speaking them. Aurora has the purest pedigree of any Disney Princess, being the first and only child of a king (King Stefan) and also presumably marries Prince Phillip, the firstborn son, and heir of a king (King Hubert).",
        "imageName": "Aurora",
    },
    
    {
        "name": "Belle",
        "category": "Princess",
        "story": "Beauty and the Beast",
        "channel": "Disney",
        "id": 1003,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/belle",
        "details": "https://disneyprincess.fandom.com/wiki/Beauty_and_the_Beast",
        "description": "Belle is the fifth Disney princess and the female protagonist of the film Beauty and the Beast and its two sequels. Paige O'Hara provides the voice/singing voice of Belle in all three films. Belle is the first Disney Princess to have a confirmed country in the movie (France) while most princesses have hints of their home countries. Belle is seventeen years old and the second Disney Princess to be of common birth. When she marries Prince Adam (a Prince Regnant of his principality), she becomes a Princess Consort",
        "imageName": "Belle",
    },
    
    {
        "name": "cinderella",
        "category": "Princess(UnOfficial)",
        "story": "Cinderella",
        "channel": "Disney",
        "id": 1004,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/cinderella",
        "details": "https://disneyprincess.fandom.com/wiki/Cinderella_(1950_film)",
        "description": "Cinderella is the titular protagonist of her eponymous film and two sequels and is the second Disney Princess. She is based on the European fairy tale of the same name, of which several variations exist. It is based on the French version. Ilene Woods provides the voice/singing voice for Cinderella (Original Disney version), Jennifer Hale provides the voice of Cinderella in the sequels, Tami Tappan provides Cinderella's singing voice in Cinderella III. Cinderella is the first Disney Princess to have siblings (albeit step-siblings) and is 19 years old. Cinderella is the first Disney Princess who is married into royalty (she marries Prince Charming).",
        "imageName": "Cinderella",
    },
    
    
    {
        "name": "Jasmine",
        "category": "Princess(UnOfficial)",
        "story": "Aladdin",
        "channel": "Disney",
        "id": 1005,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/jasmine",
        "details": "https://disneyprincess.fandom.com/wiki/Aladdin",
        "description": "Jasmine is the deuteragonist of Aladdin, its two sequels, and the television series. Linda Larkin provides Jasmine's voice in all animated iterations of Aladdin, Lea Solanga provides the singing voice for Jasmine in the original Aladdin, Liz Callaway provides the singing voice for Jasmine in the sequels. Jasmine is the daughter (and only child) of the Sultan of Agrabah, the traditional title styled \"Shahzadi Sultana\" (Princess). When she marries Aladdin, a commoner (the son of the self-styled \"King of Thieves\" notwithstanding), he gains the title, Prince Consort. Upon the death or abdication of her father in favor of Aladdin (as was stated to be the Sultan's wish), Aladdin would become the Sultan of Agrabah and Jasmine would acquire the title of Sultana. She is the first princess to not be the titular character in her film and is the first non-white and the first Middle Eastern/southwest Asian princess.",
        "imageName": "Jasmine",
    },
    
    {
        "name": "Merida",
        "category": "Princess",
        "story": "Brave",
        "channel": "Disney",
        "id": 1006,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/merida",
        "details": "https://disneyprincess.fandom.com/wiki/Brave",
        "description": "Merida is the protagonist of the Disney/Pixar film Brave, making her the first Pixar Princess. She is the first princess since Ariel to have red hair: she has long, curly, red hair and blue eyes. Kelly MacDonald and Julie Fowlis provide the voice and singing voice for Merida. Merida is a Princess by blood; firstborn of King Fergus of DunBroch. Her lack of romantic interest (and lack of any sequels) makes it unlikely that she will rise to rule the kingdom as a Regnant Queen, considering the views of gender equality in the era.",
        "imageName": "Merida",
    },
    
    {
        "name": "Moana",
        "category": "Princess",
        "story": "Moana",
        "channel": "Disney",
        "id": 1007,
        "isFeatured": false,
        "isFavorite": false,
        "link": "https://princess.disney.com/moana",
        "details" : "https://princess.disney.com/moana",
        "description": "Moana is the titular protagonist of the Disney film of the same name. The daughter of Motunui's village chief, Moana was chosen by the Ocean to restore the Heart of Te Fiti and save her island from life-killing darkness.The fourth Princess to come from the minds of John Musker and Ron Clements, Moana is one of the few Disney Princesses not to be based on a preexisting character. Rather, her story (save for Maui and his exploits) is almost wholly original. Furthermore, unlike her most recent predecessors, Moana was not inducted with a coronation event. Instead, she was slowly integrated into official Disney Princess merchandise such as books, social media posts, and toylines following the release of her film, before being added to the franchise's official website as an official member in 2019. She is the first princess since Mulan, and the ninth princess overall to be officially inducted into the franchise without a coronation. However, she is the first princess to be lately inducted when the franchise was already in function. She is also the second princess, after Merida who doesn't have a love interest and the third CGI Princess after Rapunzel and Merida",
        "imageName": "Moana"
    },
    
    {
        "name": "Mulan",
        "category": "FormerPrincess",
        "story": "Mulan",
        "channel": "Disney",
        "id": 1008,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/mulan",
        "details" : "https://disneyprincess.fandom.com/wiki/Mulan_(1998_film)",
        "description": "Fa Mulan is the titular protagonist in the Disney film Mulan and its sequel Mulan II. She is the first Disney Princess to be based on a legend and the second not to be based on a fairy tale (Pocahontas). Ming-Na Wen and Lea Salonga provide the voice and singing voice of Mulan in both films, respectively. Mulan is (to date) the only Disney Princess who does not hold the title of Princess in one form or another. However, she does earn the non-noble title of Imperial Consul. Her eventual marriage to General Li Shang (also non-noble) does not grant her any titles either. Mulan and Shang are the only non-royal Disney couple in the Disney Princess franchise.",
        "imageName": "Mulan",
    },
    
    {
        "name": "Pocahontas",
        "category": "FormerPrincess",
        "story": "Pocahontas",
        "channel": "Disney",
        "id": 1009,
        "isFeatured": true,
        "isFavorite": false,
        "link": "https://princess.disney.com/pocahontas",
        "details" : "https://disneyprincess.fandom.com/wiki/Pocahontas",
        "description": "Pocahontas is the protagonist of the film Pocahontas and its sequel, Pocahontas II, and is the first Disney Princess to have been based (loosely) on a real person, instead of a fairy tale. She is a Powhatan Native American, and she is the first Disney Princess to have two \"princes\" (John Smith and John Rolfe, though only the former is an official Disney Prince). Pocahontas is the second Princess (after Jasmine) to have her singing voice and speaking voice provided by two different voice actresses. Irene Bedard and Judy Kuhn provide the voice and singing voice of Pocahontas in both movies, respectively. Pocahontas was born as the only child of Chief Powhatan, thus giving her the title of Chieftain's Daughter. Though not royalty, she is accorded the respect of one (i.e. a princess) in the sequel and is officially regarded as a Disney Princess. Her eventual marriage to John Rolfe (a commoner) does not change her status or his.",
        "imageName": "Pocahontas",
    },
    
    {
        "name": "Rapunzel",
        "category": "FormerPrincess",
        "story": "Tangled",
        "channel": "Disney",
        "id": 1010,
        "isFeatured": false,
        "isFavorite": false,
        "link": "https://princess.disney.com/rapunzel",
        "details" : "https://disneyprincess.fandom.com/wiki/Tangled",
        
        "description": "Rapunzel is the protagonist in the film Tangled and the short film Tangled Ever After, based on the Brothers Grimm story Rapunzel. Like Aurora, she has golden hair, was born into her title, and was removed from her parent's custody as a baby, only to be reunited in her teens. Mandy Moore provides both the speaking and singing voices for Rapunzel. She is one of the stronger-willed Princesses and her preferred weapon is a frying pan. As the only child of King Frederic and Queen Arianna of Corona, she eventually marries Eugene \"Flynn Rider\" Fitzherbert, giving him the title of Prince Consort. Upon the death or abdication of her father, Rapunzel will become Queen Regnant of Corona, while her husband will remain Prince Consort.",
        "imageName": "Rapunzel"
    },
    
    
    {
        "name": "Snow White",
        "category": "Princess",
        "story": "Snow White and the Seven Dwarfs",
        "channel": "Disney",
        "id": 1011,
        "isFeatured": false,
        "isFavorite": false,
        "link": "https://princess.disney.com/snow-white",
        "details" : "https://disneyprincess.fandom.com/wiki/Snow_White_and_the_Seven_Dwarfs",
        
        "description": "Snow White, the titular character of the 1937 Disney movie Snow White and the Seven Dwarfs, is a character based on the German fairy tale \"Schneewittchen.\" Snow White has the honor of being the first Princess in the first Disney animated feature, paving the way for all subsequent princesses. Adriana Caselotti provides the voice/singing voice for Snow White. Her true love is the Prince, who is able to wake her from her eternal sleep with true love's kiss. At 14, she is the youngest of the official Disney Princesses.",
        "imageName": "Snow_White"
    },
    
    {
        "name": "Tiana",
        "category": "Princess(UnOfficial)",
        "story": " The Princess and the Frog",
        "channel": "Disney",
        "id": 1012,
        "isFeatured": false,
        "isFavorite": false,
        "link": "https://princess.disney.com/tiana",
        "details" : "https://disneyprincess.fandom.com/wiki/The_Princess_and_the_Frog",
        
        "description": "Tiana is the protagonist in the film The Princess and the Frog. Tiana made history as the first African-American Disney Princess. Anika Noni Rose provides the voice/singing for Tiana. She is the third to be married into her title. Commoner-born, Tiana becomes Princess Consort upon her marriage to Prince Naveen, the eldest son and Heir Apparent of the King of Maldonia. She is the most modern of all princesses due to living in 1920s New Orleans and is the first American and first black princess",
        "imageName": "Tiana"
    }
]
